tutorials/multiform/dynamicRetention/squareChannel/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
        type            zeroGradient;
        value     uniform 0;
    }

    upperWall
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
      type            dynamicRetention;
      value           uniform 0;
      RobinD          uniform 1;
      RobinK          uniform -100;
      RobinF          uniform 0;
      S               uniform 0;
      shearDetachment false;

      Kd              uniform -100;

      forwardReaction
      {
          type         saturatingPowerLaw;
          S0           0.1;
          n            1;
      }

      backwardReaction
      {
          type        constant;
      }

      shearDetachmentRate
      {
          type        shearLinear;
          K           1;
      }
    }
}

// ************************************************************************* //
