tutorials/multiform/dynamicRetention/squareChannel/Allrun
#!/bin/bash

. $WM_PROJECT_DIR/bin/tools/RunFunctions
. $WM_PROJECT_DIR/bin/tools/CleanFunctions

cleanCase
blockMesh
scalarTransportFoam
