tutorials/multiform/dynamicRetention/squareChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(

    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0 1 0)

    (0 0 1)
    (10 0 1)
    (10 1 1)
    (0 1 1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (40 40 40)
    simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
   frontAndBack
    {
        type zeroGradient;
        faces
        (
            (0 1 2 3)
            (7 6 5 4)
            (0 4 5 1)
            (3 2 6 7)
        );
    }
);

// ************************************************************************* //
